# RestoreOrientationAndLock Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..RestoreOrientationAndLock Method
View3D Class See Also
---
Locks the view and restores its orientation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void RestoreOrientationAndLock()
```

Visual Basic
---
```text
Public Sub RestoreOrientationAndLock
```

Visual C++
---
```text
public:
void RestoreOrientationAndLock()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | View has never been locked. |

# See Also
View3D Class
Autodesk.Revit.DB Namespace